# running in wd_cover/src/
read -formal wd.v
prep -top watchdog_timer

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
