# running in watchdog_prove/src/
read -formal watchdog_formal.v
prep -top watchdog_timer

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
